README.md
```mermaid
flowchart LR
    title[<u>Diagramme de cas d'utilisation - GeomeTry</u>]

    %% Actor
    Joueur([Joueur])

    %% Main menu use cases
    subgraph MenuPrincipal["Menu principal"]
        Jouer(["Jouer"])
        ChoisirNiveau(["Choisir un niveau"])
        CreerNiveau(["Créer un niveau"])
        EditerNiveau(["Editer un niveau"])
        ModifierOptions(["Modifier les options"])
        ConsulterStats(["Consulter les stats"])
        ConsulterStatsNiveau(["Consulter les stats d'un niveau"])
        ConsulterStatsGlobales(["Consulter les stats globales"])
        QuitterJeu(["Quitter le jeu"])

        subgraph Options
            ModifierControles(["Modifier les contrôles"])
            ModifierControlesJeu(["Modifier les contrôles de jeu"])
            ModifierControlesEditeur(["Modifier les contrôles de l'éditeur"])
            ModifierVolume(["Modifier le volume"])
        end
    end

    %% Gameplay use cases
    subgraph Partie
        MettrePause(["Mettre en pause"])
        Interagir(["Intéragir"])

        subgraph Gameplay
            SauterCube(["Sauter avec le cube"])
            VolerShip(["Voler avec le ship"])
            MonterWave(["Monter avec la wave"])
        end

        subgraph Pause
            ReprendrePartie(["Reprendre la partie"])
            QuitterPartie(["Quitter la partie"])
            RecommencerPartie(["Recommencer la partie"])
        end
    end

    %% Relationships
    Joueur --> Jouer
    Jouer -.-> ChoisirNiveau
    Joueur --> CreerNiveau
    CreerNiveau <-. "<<extends>>" .-> EditerNiveau
    Joueur --> ModifierOptions
    Joueur --> ConsulterStats
    Joueur --> QuitterJeu

    ModifierOptions <-. "<<extends>>" .-> ModifierControles
    ModifierControles <-. "<<extends>>" .-> ModifierControlesJeu
    ModifierControles <-. "<<extends>>" .-> ModifierControlesEditeur
    ModifierOptions <-. "<<extends>>" .-> ModifierVolume

    ConsulterStats <-. "<<extends>>" .-> ConsulterStatsNiveau
    ConsulterStats <-. "<<extends>>" .-> ConsulterStatsGlobales

    Jouer <-. "<<extends>>" .-> MettrePause
    Jouer <-. "<<extends>>" .-> Interagir

    Interagir <-. "<<extends>>" .-> SauterCube
    Interagir <-. "<<extends>>" .-> VolerShip
    Interagir <-. "<<extends>>" .-> MonterWave

    MettrePause <-. "<<extends>>" .-> ReprendrePartie
    MettrePause <-. "<<extends>>" .-> QuitterPartie
    MettrePause <-. "<<extends>>" .-> RecommencerPartie
```
